
// Вебінар 2
// Ветвленіє і цикли

// Частина 1. Суворе порівняня (===)
// За допомогою if else
// Та значно кращий варянт це switch

// const start = 1;

// let prine;

// if (start === 1) {
//     prine = 20;
// } else if (start === 2) {
//     prine = 30;
// } else if (start === 3) {
//     prine = 50;
// } else if (start === 4) {
//     prine = 70;
// } else if (start === 5) {
//     prine = 120;
// } else {
// console.log('Такої кількості зірок нема');
//     prine = 0;
// }

// switch (start) {
//     case 1:
//         prine = 20;
//         break;
//     case 2:
//         prine = 30;
//         break;
//     case 3:
//         prine = 50;
//         break;
    
//     case 4:
//         prine = 60;
//         break

//     case 5:
//         prine = 120;
//         break;

//     default:
//         console.log('Такої кількості нема');
        
// }

// console.log(prine);

// Напиши скрипт вибора  зфхунку готеля по кількістю зірок


// const start = 0;

// let prine;

// if (start === 1 || start === 2) {
//     prine = 20;
// } else if (start === 3 || start === 4) {
//     prine = 30;
// } else if (start === 5) {
//     prine = 120;
// }  else {
// console.log('Такої кількості зірок нема');
//     prine = 0;
// }



// switch (start) {
//     case 1:
//     case 2:
//         prine = 20;
//         break;
    
        
//     case 3:
//     case 4:
//         prine = 50;
//         break;

//     case 5:
//         prine = 120;
//         break;

//     default:
//         console.log('Такої кількості нема');
        
// }



//  console.log(prine);

// Напиши скрипт вибора оції доставки товару
// Опція зберігаєтся в зміній: 1 - самовивіз, 2 - курєр, 3 - почта,

// В зміній message записати повідомлення в залежності від оції
// - "Ви зможете забрати товар завтра з 12:00 в нашому офісі"
// - "Курєр привезе замовлення завтра з 9:00 до 18:00"
// - "Посилка буде відправленна сьогодні"
// - "Вам перезвонить менеджер"

// розбираєм задачу на короткі дії

// 1. зробити перемінні

// const option = 2;
// let message = "";

// зробити switch 1 2 3;
// В кожній кейсі зробити лінії

// switch (option) {
//     case 1:
//         message = "Ви зможете забрати товар завтра з 12:00 в нашому офісі";
//         break;
    
//     case 2:
//         message = "Курєр привезе замовлення завтра з 9:00 до 18:00";
//         break;
    
//     case 3:
//         message = "Посилка буде відправленна сьогодні";
//         break;
    
//     default:
//         message = "Вам перезвонить менеджер";
// }

// Зробити log message

// console.log(message);


// ===========================================================================================

// Частина 2

// Цикл for

// Схема циклу

// for (ініціалізація, умова, пост - вираження){
    // Тіло цикла
// }

// for (let i = 0; i < 5; i += 1){
//     console.log(i);
// }

// console.log("j;lkjlklk;");


// Напиши скрипт який рахує спільну сумму зарплати працівників.
// Кількість працівників зберігається в переміній employees.
// Зарплата кожного працівника це раптове число від 500 до 5000
// написати сумму в переміну totalSalary і вивести в консоль

// // 1 зробити перемінні
// const mixSalary = 500;
// const maxSalary = 5000;
// const employees = 4;
// let totalSalary = 0;

// // 2 перебрати працівників в циклі
// for (let i = 1; i <= employees; i += 1){
//     // 3 сгенерувати раптову зп
//     const salary = Math.round(
//         Math.random() * (maxSalary - mixSalary) + mixSalary
//     );
//     console.log(`ЗП працівника номер ${i} - ${salary}`);
   
//     // 4 добавити до тоталу
//     totalSalary += salary;
    
// }

// 5 console.log();
// console.log('totalSalary', totalSalary);


// Напиши скрипт який рахує сумму всіх чітких чисел,
// які входять діапазон чисел в перемінних від min до max.
// Наприклад, якщо min = 0 і max = 5, то діапазон 0-5, і в ньому два парні числа - 2 і 4,
// їх сумма 6.

// // 1 переремінні
// const min = 6;
// const max = 13;
// let total = 0;

// // 2 фор от min до max з кроком в 1

// for (let i = min; i <= max; i += 1){

//     console.log(i);

// // 3 провіряєм залишок від ділення
//     if (i % 2 === 0) {
//         console.log('парне: ', i);

//         // 4 пишемо в сумму

//         total += i;
//     }
// }

// console.log("total: ", total);

// ====================================================================================

// Частина 3

// Напиши баланс обробки покупки в магазині
//     - баланс користувача зберігаючийся в переміній balance
//     - сумма покупки зберігаются в переміній PaymentMethodChangeEvent
 
//     - перед перевіркою вивести повідомлення:
// "Спільна ціна замовлення [число] кредитів. Перевіряємо кількість доступних кредитів на рахунку"
    
//     - Якщо сума покупки не перевищує баланс:
// - Вичеслити із суму покупки
//     - Вивести повідомлення  "на рахунку залишилось [число] кредитів "

//     - Якщо сумма покупки перевищує баланс:
// - Вивести повідомлення "На рахунку недостатньо коштів для проведення операції!"
//     - В кінці вивести повідомлення "Процес завершенно"


// 1 премінні
// let balance = 10000;
// const payment = 2000;

// console.log(
//     `Спільна ціна замовлення ${payment} кредитів. Перевіряємо кількість доступних кредитів на рахунку`
// );


// // 2 умови сумми <= баланс
// if (balance >= payment) {
    

//     balance -= payment;

//     console.log(`На рахунку залишилось ${balance} кредитів`);
// } else {
//     console.log('На рахунку недостатньо коштів для проведення операцій!');
// }

// console.log("Операція завершена");

// =======================================================================

// Частина 4

// Напиши скрипт підрахунку сумми закупівлі зі знижкою в залежності
// від витраченої сумми за весь час(партнерська прогама)

//     - cпільна сумма витраченого зберігаєтся в зміній totalSpent
//     - Сумма даного балансу зберігаєтся в переміній payment
//     - Сумма зберігаєтся в зміній disctop


//     - Якщо витрачено більше від[100 до 1000] - бронзовий партнер, скидка 2 %
//     - Якщо витрачено від[1000 до 5000]- серебряний партнер, скидка 5 %
//     - Якщо витрачено більше[5000 - золотий партнер, скидка 10 %]
// - Якщо потрачено менше 100 - не партнер, скидка 0 %
        
//     - В результаті вивести повідомлення 
//     "Оформляємо замовлення на суму [сумма] зі скидкою [скидка]%" 
            
const totalSpent = 110;
let payment = 500;
let disctop = 0;

if (totalSpent >= 100 && totalSpent < 1000) {
    console.log("Бронзовий парнер, 2%");
    disctop = 0.02;
} else if (totalSpent >= 1000 && totalSpent < 5000) {
    console.log("Серебряний партнер, знижка 5 %");
    disctop = 0.05;
} else if (totalSpent >= 5000){
    console.log("Золотий партнер, знижка 10 %");
    disctop = 0.1;
} else {
    console.log("не партнер, скидка 0%");
}

console.log(
    `Оформляємо замовлення на суму ${payment} зі скидкою ${disctop * 100}%`,
);



// Бронзовий партнер, знижка 2 %
// Серебряний партнер, знижка 5 %
// Золотий партнер, знижка 10 %
// У вас ще немає партнерської знижки
            


function makeTransaction(pricePerDroid, orderedQuantity, customerCredits) {
  let message;
  // Change code below this line
let totalPrice = pricePerDroid * orderedQuantity;


if(totalPrice >= customerCredits){
  message = "Insufficient funds!";
} else {
let customerCredits = customerCredits - totalPrice; 
  message = `'You ordered ${pricePerDroid} droids, you have ${customerCredits} credits left'`;
};


  // Change code above this line
  return message;
}









